app/controllers/products_controller.rb

SELECT `products`.* FROM `products` ORDER BY id ASC LIMIT 20
---
  def index
    @products = Product.order("id ASC").limit(20)

SELECT `products`.* FROM `products` WHERE `products`.`id` IN (16, 13, 15)
---
  def show
    @product = Product.find(params[:id])

SELECT `products`.* FROM `products` WHERE (title LIKE('%mmm%'))
---
  def search
    @lookings = Product.where("title LIKE(?)","%#{params[:keyword]}%")