app/controllers/reviews_controller.rb

SELECT `products`.* FROM `products` WHERE `products`.`id` IN (16, 13, 15)
---
  def new
    # binding.pry
    @product = Product.find(params[:product_id])

INSERT INTO `reviews` (`created_at`, `nickname`, `product_id`, `rate`, `review`, `updated_at`) VALUES ('2016-03-26 09:28:59', 'ままま', 16, 5, 'っままっままm', '2016-03-26 09:28:59')
---
  def create
    redirect_to "/users/sign_in" and return unless user_signed_in?
    Review.create(review_params)