app/views/products/index.html.erb

SELECT AVG(`reviews`.`rate`) AS avg_id FROM `reviews` WHERE `reviews`.`product_id` = 13
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`product_id` = 13
---

                          <i class="star-actived rate-<%= product.reviews.average(:rate).round if product.reviews.present? %>0"></i>